export const 複文毛目 = (bi) => {
    const u = bi.u;
    const 橫 = (書, 寬 = 0.78) => bi.一筆({ 寬: 寬 * u, 起: '藏', 收: '回' }, 書);
    const 鉤 = (書, 寬 = 0.9) => bi.一筆({ 寬: 寬 * u, 起: '藏', 收: '出' }, 書);
    // 雙毛並肩
    for (const cx of [-3.5, 3.5]) {
        鉤(p => p.M(cx + 1.6, 3.0).C(cx + 0.5, 3.5, cx - 0.7, 3.8, cx - 1.8, 3.9), 0.75); // 首撇
        橫(p => p.M(cx - 2.2, 5.5).L(cx + 2.2, 5.2));
        橫(p => p.M(cx - 2.4, 7.0).L(cx + 2.4, 6.7));
        鉤(p => p.M(cx - 0.1, 3.4) // 豎彎鉤
            .C(cx - 0.4, 5.5, cx - 0.6, 7.4, cx - 0.5, 8.9)
            .C(cx - 0.4, 10.0, cx + 0.4, 10.6, cx + 1.6, 10.7)
            .C(cx + 2.3, 10.7, cx + 2.7, 10.3, cx + 2.8, 9.7));
    }
    // 雙目匡並立
    for (const cx of [-3.5, 3.5]) {
        橫(p => p.M(cx - 2.0, 13.3).L(cx - 2.0, 21.1), 0.82);
        橫(p => p.M(cx + 2.0, 13.1).L(cx + 2.0, 21.1), 0.82);
        橫(p => p.M(cx - 2.1, 13.4).L(cx + 2.1, 13.3));
        橫(p => p.M(cx - 2.0, 16.0).L(cx + 2.0, 15.9));
        橫(p => p.M(cx - 2.0, 18.6).L(cx + 2.0, 18.5));
        橫(p => p.M(cx - 2.1, 21.0).L(cx + 2.1, 20.9));
    }
};
